package project.cn.edu.tongji.sse.nowfitness.presenter;

import android.content.Context;
import android.content.Intent;
import android.widget.ImageView;

import com.bumptech.glide.Glide;
import com.google.gson.Gson;
import com.google.gson.GsonBuilder;
import com.google.gson.reflect.TypeToken;
import com.youth.banner.Banner;
import com.youth.banner.BannerConfig;
import com.youth.banner.Transformer;
import com.youth.banner.loader.ImageLoader;

import java.io.Serializable;
import java.lang.reflect.Type;
import java.util.ArrayList;
import java.util.List;

import project.cn.edu.tongji.sse.nowfitness.R;
import project.cn.edu.tongji.sse.nowfitness.model.DoubanBookModel;
import project.cn.edu.tongji.sse.nowfitness.view.LeftView.BooksDetailView;

/**
 * Created by a on 2018/11/23.
 */

public class BookPresenter {
    private Banner bookBanner;
    private List<DoubanBookModel> booksLab;
    private List<String> title;
    private List<String> images;
    private Context mContext;
    public void setBookBanner(Banner banner){
        this.bookBanner=banner;
        Gson gson ;
        GsonBuilder builder;
        builder=new GsonBuilder();
        gson=builder.create();
        List<DoubanBookModel> mList=new ArrayList<DoubanBookModel>();
        Type type1=new TypeToken<List<DoubanBookModel>>(){}.getType();
        mList=gson.fromJson(booksListJson, type1);
        setBooksLab(mList);
        resetBanner();
    }
    public void setBooksLab(List<DoubanBookModel> bookModelList){this.booksLab = bookModelList;}
    public BookPresenter(Context context){
        mContext = context;
        title = new ArrayList<>();
        images = new ArrayList<>();
        booksLab = new ArrayList<>();
    }
    public void initBannner(){
        bookBanner.setBannerStyle(BannerConfig.CIRCLE_INDICATOR_TITLE_INSIDE);
        //设置图片集合
        bookBanner.setImageLoader(new MyImageLoader());
        bookBanner.setImages(images);

        //设置bookBanner动画效果
        bookBanner.setBannerAnimation(Transformer.Default);
        //设置标题集合（当bookBanner样式有显示title时）
        bookBanner.setBannerTitles(title);
        //设置自动轮播，默认为true
        bookBanner.isAutoPlay(true);
        //设置轮播时间
        bookBanner.setDelayTime(1500);
        //设置指示器位置（当bookBanner模式中有指示器时）
        bookBanner.setIndicatorGravity(BannerConfig.LEFT);
        bookBanner.start();

    }
    public  void jumpToBookDetail(int position){
        Intent intent = new Intent(mContext,BooksDetailView.class);
        intent.putExtra("books",(Serializable) booksLab);
        intent.putExtra("position",position);
        mContext.startActivity(intent);

    }
    public void resetBanner(){
        for(DoubanBookModel book : booksLab){
            title.add(book.getTitle());
            images.add(book.getImage());
        }
        initBannner();
    }
    private class MyImageLoader extends ImageLoader {
        @Override
        public void displayImage(Context context, Object path, ImageView imageView) {
            Glide.with(context.getApplicationContext())
                    .load(path)
                    .into(imageView);
        }
    }
    private String booksListJson = " [\n" +
            "        {\n" +
            "            \"rating\": {\n" +
            "                \"max\": 10,\n" +
            "                \"numRaters\": 1709,\n" +
            "                \"average\": \"8.7\",\n" +
            "                \"min\": 0\n" +
            "            },\n" +
            "            \"subtitle\": \"用自身体重锻练\",\n" +
            "            \"author\": [\n" +
            "                \"马克·劳伦\",\n" +
            "                \"乔舒亚·克拉克\"\n" +
            "            ],\n" +
            "            \"pubdate\": \"2012-9-1\",\n" +
            "            \"tags\": [\n" +
            "                {\n" +
            "                    \"count\": 2255,\n" +
            "                    \"name\": \"健身\",\n" +
            "                    \"title\": \"健身\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 801,\n" +
            "                    \"name\": \"健康\",\n" +
            "                    \"title\": \"健康\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 704,\n" +
            "                    \"name\": \"运动\",\n" +
            "                    \"title\": \"运动\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 674,\n" +
            "                    \"name\": \"锻炼\",\n" +
            "                    \"title\": \"锻炼\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 357,\n" +
            "                    \"name\": \"徒手\",\n" +
            "                    \"title\": \"徒手\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 197,\n" +
            "                    \"name\": \"健美\",\n" +
            "                    \"title\": \"健美\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 180,\n" +
            "                    \"name\": \"美国\",\n" +
            "                    \"title\": \"美国\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 157,\n" +
            "                    \"name\": \"科普\",\n" +
            "                    \"title\": \"科普\"\n" +
            "                }\n" +
            "            ],\n" +
            "            \"origin_title\": \"You Are Your Own Gym\",\n" +
            "            \"image\": \"https://img3.doubanio.com/view/subject/m/public/s24403715.jpg\",\n" +
            "            \"binding\": \"平装\",\n" +
            "            \"translator\": [],\n" +
            "            \"catalog\": \"前进！\\n1 任务目标：结实、强壮、自信\\n2 我的历程\\n3 为什么进行自身体重训练？\\n4 为什么进行力量训练？\\n5 究竟什么是体能？\\n6 营养：回归基础\\n7 力量训练的常见认识误区\\n8 借口和动力\\n9 锻炼强度\\n10 锻炼方法\\n11 练习动作\\n12 推力练习\\n13 拉力练习\\n14 腿部和臀部练习\\n15 核心区练习\\n16 全身练习\\n17 健身计划\\n18 更短、更强的20分钟锻炼！\\n附录一　自制健身装备\\n附录二　成功健身必须遵循的6个原则\\n附录三　健身计划背后的科学\\n附录四　练习索引\\n附录五　健身日志\",\n" +
            "            \"pages\": \"223\",\n" +
            "            \"images\": {\n" +
            "                \"small\": \"https://img3.doubanio.com/view/subject/s/public/s24403715.jpg\",\n" +
            "                \"large\": \"https://img3.doubanio.com/view/subject/l/public/s24403715.jpg\",\n" +
            "                \"medium\": \"https://img3.doubanio.com/view/subject/m/public/s24403715.jpg\"\n" +
            "            },\n" +
            "            \"alt\": \"https://book.douban.com/subject/11608712/\",\n" +
            "            \"id\": \"11608712\",\n" +
            "            \"publisher\": \"北京科学技术出版社\",\n" +
            "            \"isbn10\": \"7530459929\",\n" +
            "            \"isbn13\": \"9787530459928\",\n" +
            "            \"title\": \"无器械健身\",\n" +
            "            \"url\": \"https://api.douban.com/v2/book/11608712\",\n" +
            "            \"alt_title\": \"You Are Your Own Gym\",\n" +
            "            \"author_intro\": \"马克?劳伦是美国军方的体能训练专家、特种作战管理者、三项全能运动员，还是一个顶级的泰拳手。他曾经有效地训练过近1000名士兵，使他们达到了最精锐的特种部队的极端体能要求。作为一个有经验的指挥官，他善于计划和执行诸如机场占领、战斗搜寻和营救、低空支持、侦察和监控等任务。他训练的部队能够通过空投、越野载具、步行、潜水及其他的两栖作战方法立即部署前线作战行动。乔舒亚?克拉克是《心如止水：卡特里娜飓风中的生命》的作者，他的著作出现在许多报纸、杂志和文选中。他还是一个获得了资格认证的私人教练，自从卡特里娜飓风毁了他的健身中心后，他再也没有踏进健身房一步。\",\n" +
            "            \"summary\": \"无器械健身：用自身体重锻炼，ISBN：9787530459928，作者：（美）马克·劳伦，乔舒亚·克拉克 著 蔡杰 译\",\n" +
            "            \"price\": \"49.00元\"\n" +
            "        },\n" +
            "        {\n" +
            "            \"rating\": {\n" +
            "                \"max\": 10,\n" +
            "                \"numRaters\": 1552,\n" +
            "                \"average\": \"9.3\",\n" +
            "                \"min\": 0\n" +
            "            },\n" +
            "            \"subtitle\": \"\",\n" +
            "            \"author\": [\n" +
            "                \"[美] 阿诺德·施瓦辛格\"\n" +
            "            ],\n" +
            "            \"pubdate\": \"2012-1\",\n" +
            "            \"tags\": [\n" +
            "                {\n" +
            "                    \"count\": 1893,\n" +
            "                    \"name\": \"健身\",\n" +
            "                    \"title\": \"健身\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 720,\n" +
            "                    \"name\": \"施瓦辛格\",\n" +
            "                    \"title\": \"施瓦辛格\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 677,\n" +
            "                    \"name\": \"运动\",\n" +
            "                    \"title\": \"运动\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 619,\n" +
            "                    \"name\": \"肌肉\",\n" +
            "                    \"title\": \"肌肉\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 523,\n" +
            "                    \"name\": \"健美\",\n" +
            "                    \"title\": \"健美\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 498,\n" +
            "                    \"name\": \"健康\",\n" +
            "                    \"title\": \"健康\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 447,\n" +
            "                    \"name\": \"运动健身\",\n" +
            "                    \"title\": \"运动健身\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 301,\n" +
            "                    \"name\": \"男人\",\n" +
            "                    \"title\": \"男人\"\n" +
            "                }\n" +
            "            ],\n" +
            "            \"origin_title\": \"\",\n" +
            "            \"image\": \"https://img1.doubanio.com/view/subject/m/public/s7022558.jpg\",\n" +
            "            \"binding\": \"平装\",\n" +
            "            \"translator\": [\n" +
            "                \"万义兵\",\n" +
            "                \"费海汀\",\n" +
            "                \"杨婕\"\n" +
            "            ],\n" +
            "            \"catalog\": \"前言\\n第一部分 健身入门\\n第一章 演变和历史 2\\n健美比赛的开始 5\\n40年代及50年代的健美比赛 7\\n60年代的健美比赛 9\\n70年代的健美比赛 12\\n《举重》 17\\n80年代和90年代的健美比赛 17\\n健身运动的飞速发展 19\\n“阿诺德健身周末” 20\\n健身运动的职业化 21\\n乔•韦德 21\\n现代训练的演变 23\\n健身运动的未来 24\\n女子健身与健美 25\\n第二章 健身基础知识 28\\n渐进的过程 28\\n举重、阻力训练和健身 29\\n有氧运动与肌肉清晰度 34\\n运动员的健身 35\\n重量训练与健康 41\\n第三章 训练体验 43\\n所想即所得 43\\n泵感 45\\n训练强度 46\\n肌肉疼痛和肌肉酸痛 47\\n障碍与挫败 49\\n训练伙伴 51\\n安排训练日程 53\\n女性健身 55\\n第四章 健身场所 57\\n健身房“大爆炸” 57\\n在健身房里要看什么 58\\n环境与氛围 58\\n普通健身者如何选择健身房 60\\n在家训练 61\\n第五章 开始训练 63\\n进步快的人和进步慢的人 65\\n自由重量还是组合器械—关于重力 67\\n鞋子 68\\n手套 69\\n腕带 69\\n腰带 69\\n护肘和护膝 71\\n练颈帽 71\\n倒吊鞋 72\\n训练日志 72\\n健身与孩子 73\\n起步较晚 74\\n关于健美比赛 74\\n第二部分 训练计划\\n第一章 基础训练原则 82\\n个体的需求 82\\n循序渐进 83\\n反复 84\\n练到力竭 84\\n练习组 86\\n动作的幅度 87\\n肌肉收缩的质量 87\\n热身 88\\n强力训练 89\\n“重磅日” 91\\n训练过度与恢复 92\\n组间休息 93\\n呼吸 94\\n拉伸 94\\n拉伸练习 96\\n站姿侧弯 96 站姿前弯 96 腘绳肌拉伸练习 97\\n弓步压腿 98 分腿坐姿前屈 99 大腿内侧拉伸练习 100\\n股四头肌拉伸练习 100 跨栏式伸展 101\\n脊柱扭转练习 101 悬垂拉伸练习 102\\n第二章 了解你的身体类型 103\\n认识你的体型 105\\n新陈代谢和肌肉生长 108\\n外胚型训练 108\\n中胚型训练 109\\n内胚型训练 109\\n身体成分测试 110\\n第三章 基础训练计划 112\\n分化训练 112\\n基本的肌肉群 113\\n组织你的训练 114\\n休息和恢复 117\\n何时训练 117\\n训练计划•阶段1 118\\n训练计划•阶段2 120\\n第四章 高级训练原则 122\\n增加训练强度 122\\n强度技巧 123\\n强力训练原则 126\\n学习使用高级训练原则 132\\n第五章 练就一流的身材：高级训练计划 134\\n何时开始高级训练 135\\n\\\"高组数\\\"训练 136\\n双分化训练 137\\n高级训练计划 139\\n两阶段高级计划 139\\n训练计划•阶段1 140\\n训练计划•阶段2 142\\n达到极限 144\\n变更训练计划 144\\n弱点训练 146\\n训练弱区 147\\n第六章 参赛训练计划 151\\n塑造参赛体形 151\\n对于变小的恐惧 153\\n参赛训练的基本元素 154\\n依靠你的训练伙伴 155\\n训练量 155\\n选择练习动作 156\\n分化训练 156\\n参赛训练计划 158\\n个性化训练计划 160\\n肌肉分离度 160\\n发达度和清晰度：分析你的进步 161\\n户外训练 162\\n第七章 精神高于一切 164\\n大目标和小目标 166\\n从失败中学习 167\\n肌肉抑制 167\\n动机最大化 168\\n冲破障碍 169\\n健身如何影响精神 170\\n第三部分 身体部位练习\\n肩部 177\\n肩部的肌肉 177\\n观察肩部 178\\n训练三角肌 182\\n基础训练计划 182\\n高级训练计划 183\\n参赛训练计划 183\\n训练斜方肌 184\\n弱点训练 185\\n肩部练习 190\\n杠铃推举 190 颈后推举 191 提铃上举 192\\n借力推举 193 器械推举 194 哑铃推举 195\\n阿诺德推举 196 站姿侧平举 197\\n拉力器单臂交叉侧平拉 198 拉力器单臂侧平拉 199\\n坐姿拉力器单臂交叉侧平拉 200\\n反握哑铃过顶侧平举 201 器械侧平举 201\\n哑铃前平举 202 坐姿俯身哑铃侧平举 203\\n站姿俯身哑铃侧平举 204 俯身拉力器侧平拉 205\\n侧卧侧平举 206\\n斜方肌练习 207\\n直立划船 207 大重量的直立划船 208 哑铃耸肩 209\\n杠铃耸肩 209\\n胸部 210\\n胸部的肌肉 210\\n完全发达的胸部 211\\n训练胸部 214\\n基础训练计划和高级训练计划 215\\n参赛训练计划 216\\n弱点训练 217\\n强力训练 222\\n前锯肌 222\\n训练前锯肌 223\\n胸部练习 224\\n仰卧杠铃推举 224 上斜杠铃推举 226 器械推举 227\\n仰卧哑铃推举 228 下斜哑铃推举 228\\n上斜哑铃推举 229 哑铃飞鸟 230 上斜哑铃飞鸟 231\\n器械飞鸟 231 站姿拉力器夹胸 232\\n前倾拉力器夹胸 233 仰卧拉力器夹胸 233\\n双杠屈臂撑 234 仰卧直臂上拉 235 器械上拉 235\\n绳索下拉 236 单臂拉力器下拉 237 窄握引体向上 237\\n悬垂前锯肌卷腹 238 悬垂哑铃划船 238\\n背部 239\\n背部的肌肉 239\\n训练背部 240\\n背部肌肉的功能 244\\n设计背部训练计划 245\\n弱点训练 245\\n拉伸和紧缩 248\\n背部练习 249\\n宽握颈后引体向上 249 宽握正面引体向上（可选） 250\\n窄握引体向上 250 背阔肌器械下拉 251\\n窄握或中等握距下拉 251 俯身杠铃划船 252\\n俯身哑铃划船 254 T杠划船 255 单臂哑铃划船 256\\n单臂拉力器划船 257 坐姿拉力器划船 258\\n器械划船 258 屈臂杠铃上拉 259 器械上拉 259\\n硬拉 260 负重体前屈 262 俯卧挺身 262\\n臂部 263\\n臂部的肌肉 263\\n训练臂部 264\\n完美的臂部 267\\n训练肱二头肌 268\\n借力弯举 272\\n基础训练计划 272\\n高级训练计划 273\\n参赛训练计划 273\\n弱点训练 274\\n训练肱三头肌 281\\n基础训练计划和高级训练计划 282\\n参赛训练计划 283\\n弱点训练 284\\n训练前臂 287\\n基础训练计划 288\\n高级训练计划 289\\n参赛训练计划 289\\n弱点训练 290\\n臂部练习—肱二头肌 292\\n站姿杠铃弯举 292 臂托板弯举（可选） 294\\n借力弯举 294 斜托弯举 295 三部弯举（21响礼炮） 297\\n上斜哑铃弯举 298 坐姿哑铃弯举 299\\n锤击式弯举（可选） 299 交替哑铃弯举 300\\n集中弯举 301 仰卧哑铃弯举 302 双手拉力器弯举 303\\n斜托拉力器弯举（可选） 303 反握弯举 304\\n反握斜托弯举 304 肱二头肌训练器 305 器械弯举 305\\n臂部练习—肱三头肌 306\\n拉力器下压 306 单臂拉力器反握下压 308\\n坐姿臂屈伸 308 站姿臂屈伸 309 仰卧臂屈伸 310\\n仰卧哑铃臂屈伸 312 仰卧交叉臂屈伸（可选） 312\\n俯身臂屈伸 313 单臂臂屈伸 314 屈臂撑 315\\n背后屈臂撑 316 固定杠臂屈伸 316\\n臂部练习—前臂 317\\n杠铃腕弯举 317 单臂哑铃腕弯举 318 背后腕弯举 319\\n反握杠铃腕弯举 320 反握哑铃腕弯举 320\\n反握杠铃弯举 321 反握斜托杠铃弯举 322\\n反握器械弯举 323 单臂反握拉力器弯举 324\\n大腿 325\\n大腿的肌肉 325\\n大腿训练的重要性 327\\n腿部训练的要求 328\\n训练股四头肌 330\\n训练腘绳肌 332\\n基础训练计划和高级训练计划 333\\n参赛训练计划 334\\n紧缩和拉伸 336\\n弱点训练 338\\n大腿练习 340\\n深蹲 340 大重量深蹲 341 半深蹲 341\\n器械深蹲 342 肩前深蹲 344 挺髋深蹲 345\\n腿举 346 腿举的变式 346 哈克深蹲 347 弓步 348\\n腿屈伸 349 腿弯举 350 站姿腿弯举 350 直腿硬拉 351\\n小腿 352\\n小腿的肌肉 352\\n训练小腿 353\\n拉伸小腿 355\\n基础训练计划 355\\n高级和参赛训练计划 356\\n弱点训练 358\\n小腿练习 362\\n站姿提踵 362 屈腿训练器提踵 364 坐姿提踵 365\\n骑驴提踵 365 单腿提踵 366 反向提踵 367\\n腹部 368\\n腹部的肌肉 368\\n训练腹部 369\\n局部减肥 370\\n针对腹部的练习 371\\n腹外斜肌练习 372\\n前锯肌和肋间肌 373\\n基础训练计划 373\\n高级训练计划 374\\n参赛训练计划 374\\n弱点训练 375\\n腹部练习 376\\n卷腹 376 转体卷腹 376 反向卷腹 377\\n悬垂卷腹 378 器械卷腹 379 垂直凳卷腹 380\\n拉力器卷腹 380 罗马椅卷腹 381 坐姿屈膝上举 381\\n坐姿转体 382 俯身转体 382 抬腿 383\\n仰卧抬腿 383 仰卧屈膝抬腿 384 上斜屈膝抬腿 384\\n垂直凳屈膝抬腿 385 悬挂抬腿 385 悬垂转体抬腿 386\\n额外的抬腿练习 386 侧卧侧抬腿 387 屈膝侧抬腿 387\\n侧卧前踢腿 387 跪姿后踢腿 388 背后剪腿 388\\n完全吸腹 389\\n第四部分 健康 营养 饮食\\n第一章 营养和饮食 392\\n健身的特殊要求 393\\n基础营养物 394\\n蛋白质 395\\n碳水化合物 399\\n脂肪 401\\n水 403\\n维生素 404\\n矿物质 408\\n食物中的能量 411\\n代谢率 411\\n健身训练与热量消耗 412\\n“假”能量 413\\n营养底线 414\\n平衡饮食 415\\n糖原的重要性 416\\n酮症 416\\n吃和训练 417\\n吃的频率 418\\n第二章 体重控制：增加肌肉，减少脂肪 419\\n身体的成分 419\\n身体成分的影响因素 420\\n饮食和体型 421\\n年龄和体内脂肪 421\\n热量消耗 422\\n饮食的质量 422\\n制造“需求” 423\\n要做多少有氧运动？ 423\\n通过饮食增长肌肉 424\\n增长肌肉的饮食计划 425\\n参考饮食计划 426\\n高蛋白质、高热量饮料 428\\n怎样减肥 430\\n酮症 432\\n蛋白质的推荐饮食来源 432\\n碳水化合物的推荐饮食来源 433\\n减肥饮食的规则总结 434\\n查看标签 434\\n第三章 参赛饮食计划 436\\n控制体重、塑造身材 437\\n全部记下来 438\\n在吃，正在吃，还是在吃 439\\n营养匮乏 439\\n代谢率下降 440\\n测量身体的变化 440\\n开始行动：提前12周 442\\n酮症测试 442\\n不要做太多有氧运动 443\\n关于药物 443\\n药物和体育 445\\n使用类固醇的副作用 446\\n利尿剂 448\\n生长激素 448\\n健美比赛与药物检测 448\\n超级补剂 449\\n赛前最后一周 454\\n“虚空” 455\\n“充碳” 455\\n减掉水分 456\\n训练、造型和饮食 458\\n赛前一晚 459\\n比赛当天早上 459\\n在预赛和晚间比赛之间 459\\n比赛之后 460\\n第四章 受伤及处理 461\\n专业知识 462\\n肌肉和肌腱 462\\n关节与韧带 465\\n实践内容 468\\n小腿 468\\n膝部 468\\n大腿 469\\n腹股沟 469\\n下腹 470\\n下背 470\\n上背 471\\n肩部 471\\n胸肌 472\\n肱二头肌 472\\n肱三头肌 472\\n肘部 473\\n前臂 473\\n受伤时的训练 473\\n天气寒冷时的训练 474\\n简要总结 475\\n肌肉僵硬、酸痛以及损伤 475\\n关节疼痛及其他关节问题 475\\n饮食填充 476\\n要注意的是：脱水 476\\n我的免疫系统怎么了？ 476\\n最后的补充 476\",\n" +
            "            \"pages\": \"476\",\n" +
            "            \"images\": {\n" +
            "                \"small\": \"https://img1.doubanio.com/view/subject/s/public/s7022558.jpg\",\n" +
            "                \"large\": \"https://img1.doubanio.com/view/subject/l/public/s7022558.jpg\",\n" +
            "                \"medium\": \"https://img1.doubanio.com/view/subject/m/public/s7022558.jpg\"\n" +
            "            },\n" +
            "            \"alt\": \"https://book.douban.com/subject/7067916/\",\n" +
            "            \"id\": \"7067916\",\n" +
            "            \"publisher\": \"北京科学技术出版社\",\n" +
            "            \"isbn10\": \"7530455230\",\n" +
            "            \"isbn13\": \"9787530455234\",\n" +
            "            \"title\": \"施瓦辛格健身全书\",\n" +
            "            \"url\": \"https://api.douban.com/v2/book/7067916\",\n" +
            "            \"alt_title\": \"\",\n" +
            "            \"author_intro\": \"阿诺德·施瓦辛格是世界上赢得健美头衔最多的人，包括7次“奥林克亚先生”和3次“宇宙先生”。他是一位享誉全球的影视巨星，并曾担任美国加利福尼亚州州长一职。另外，他还是一位成功的商人、投资者和作家。他和他的家人生活在美国洛杉矶。\",\n" +
            "            \"summary\": \"所有寻求力量和肌肉的男人都必须拥有这本书——这本只有阿诺德·施瓦辛格才能写出来的书。\\n作为全球最成功的健身者，阿诺德将自己累计三十多年、全部的健身经验都写进了这本不折不扣的“百科全书”中。关于力量、肌肉和健康，这里有你需要的一切答案。无数的美国人称其为“健身圣经”，而它当之无愧：\\n1.这里的健身知识是最系统、科学并且最有效的，可以在最短的时间内，最大限度地强化、塑造你身上的每一块肌肉。\\n2.无论你有着怎样的身体，想达到怎样的目标，都能在这儿找到适合自己的技巧和建议。\\n3.书中关于健康、营养和饮食的知识非常全面，可以帮助你塑造肌肉、减去脂肪、保持最佳的活力。\\n4. 如何预防、处理运动中的受伤？这里有最权威的建议。\\n5. 书中有多达600多张图片，给你完全清晰、直观的知识。\\n6. 打算参加健美比赛？你也能从这儿找到策略和技巧。\\n7. 当然，在书中各处，阿诺德都会给你独有的灵感和动力。\\n无论你的健身经验如何，这本书都会帮助你达到你的顶峰状态。作为7次“奥林匹亚先生”头衔的得主和一个国际巨星，阿诺德与你分享他的专注、训练和投入的秘密，并向你展示怎样掌控你的身体，发掘你自己的全部潜力，以至完美。做最好的自己——绝不仅仅在身体上！\",\n" +
            "            \"price\": \"98.00元\"\n" +
            "        },\n" +
            "        {\n" +
            "            \"rating\": {\n" +
            "                \"max\": 10,\n" +
            "                \"numRaters\": 3738,\n" +
            "                \"average\": \"7.8\",\n" +
            "                \"min\": 0\n" +
            "            },\n" +
            "            \"subtitle\": \"你的第一本健身书\",\n" +
            "            \"author\": [\n" +
            "                \"斌卡\"\n" +
            "            ],\n" +
            "            \"pubdate\": \"2015-6-1\",\n" +
            "            \"tags\": [\n" +
            "                {\n" +
            "                    \"count\": 1566,\n" +
            "                    \"name\": \"健身\",\n" +
            "                    \"title\": \"健身\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 636,\n" +
            "                    \"name\": \"健康\",\n" +
            "                    \"title\": \"健康\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 563,\n" +
            "                    \"name\": \"【运动/健身】\",\n" +
            "                    \"title\": \"【运动/健身】\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 499,\n" +
            "                    \"name\": \"运动\",\n" +
            "                    \"title\": \"运动\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 312,\n" +
            "                    \"name\": \"【运动/健康】\",\n" +
            "                    \"title\": \"【运动/健康】\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 264,\n" +
            "                    \"name\": \"生活\",\n" +
            "                    \"title\": \"生活\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 170,\n" +
            "                    \"name\": \"自我规训的技艺\",\n" +
            "                    \"title\": \"自我规训的技艺\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 169,\n" +
            "                    \"name\": \"硬派健身\",\n" +
            "                    \"title\": \"硬派健身\"\n" +
            "                }\n" +
            "            ],\n" +
            "            \"origin_title\": \"\",\n" +
            "            \"image\": \"https://img1.doubanio.com/view/subject/m/public/s28065888.jpg\",\n" +
            "            \"binding\": \"平装\",\n" +
            "            \"translator\": [],\n" +
            "            \"catalog\": \"Introduction\\n当我们在聊健身的时候，我们在聊些什么\\nChapter 1当我们在聊健身的时候，我们在聊些什么？\\nChapter 2什么样的身材才是好身材？\\n一、那些让你看起来更棒的部位\\n二、体重能代表什么？\\n你为什么会减肥失败？\\n一、节食失败的原因\\n1.节食会让人变蠢——你知道你的大脑会被吃掉吗？\\n2.节食会反弹——减肥2斤长回10斤，这就是节食的下场\\n3.节食导致暴食——管不住自己的嘴巴，都是因为你节食！\\n二、运动失败的原因——你太容易听信他人了！\\n1.常识破坏1：只有40分钟以上的有氧运动才减肥？——大错特错！\\n2.常识破坏2：长时间的有氧运动是最 好的减肥方式？——没错，但不一定对你有用！\\n3.常识破坏3：支出脂肪就等于体脂降低？——话虽如此，但减肥不是数学\\n4.常识破坏4：超重者应该多做有氧运动？——但你也得跑得起来啊！\\nChapter 3什么样的有氧运动最减脂？\\n一、什么是HIIT？——精明减肥者的选择\\n二、为什么要采取高强度间歇式的方式？——风靡全球的HIIT是怎么减肥的？\\n1.变化的高强度——持久减脂，刺激生长激素分泌\\n2.间歇运动——强效减脂，促进脂肪代谢\\n3.HIIT——更好的有氧运动\\n三、HIIT训练的重点——怎么做HIIT效果才最 好？\\n四、简易HIIT训练计划\\n1.体重向下、楼层向上的高效减脂运动——爬楼梯\\n2.HIIT针对室内的懒人操\\n第一套 翘臀大法：侧弓步+沙发深蹲跳+臀桥\\n第二套 超速减脂大法：跳跃拍手+直膝前踢+俯卧登山\\n第三套 胸大腰细大法：俯卧撑+俯卧撑跳+平板支撑\\n第四套 美好身姿大法：十字挺身+俯卧撑跳+平板支撑\\n第五套 全面与细节：直膝前踢+哑铃深蹲推举+卷腹\\nChapter 4塑形的抗阻训练——雕塑身体细节，从抗阻做起\\n一、胸大显腰细——对抗地心引力的关键\\n二、臀翘显腿长——完美曲线的黄金分割点\\n三、私藏的性感腹肌——身体视觉上最亮丽的风景线\\n四、挺拔而有气质的肩膀——成为衣架的关键\\n五、纤细修长vs性感而有力量的胳膊\\n——拜拜了，拜拜肉\\n六、匀称而性感的小腿——比腰更显瘦的利器\\nChapter 5健身十问\\n一、健身后肌肉酸痛怎么办？\\n二、上完班后很累，应该运动吗？\\n三、空腹训练是更减脂还是对身体有害？\\n四、无器械健身真的更好吗？\\n五、骑车与跑步、跑步与快走，哪个更减肥？\\n六、关节有异响，还能运动吗？\\n七、害怕关节疼，能做抗阻训练吗？\\n八、拉伸能让我避免受伤，还是更容易受伤？\\n九、增肌与减脂可以同时进行吗？\\n十、如何选择健身房？\\nChapter 6当我们健身时，我们吃什么？\\n一、健身时到底该怎么吃，才能增肌又减脂？\\n1.卡路里篇\\n2.健身饮食——蛋白质篇\\n3.碳水化合物——最重要的营养，让肉长在该长的地方\\n4.脂肪——关键在于时间\\n二、运动对食欲的影响\\n三、为什么健身者只吃牛肉、鸡肉而不吃瘦猪肉？\\n1.健身文化\\n2.烹饪方式\\nChapter 7每日训练计划\",\n" +
            "            \"ebook_url\": \"https://read.douban.com/ebook/11663687/\",\n" +
            "            \"pages\": \"269\",\n" +
            "            \"images\": {\n" +
            "                \"small\": \"https://img1.doubanio.com/view/subject/s/public/s28065888.jpg\",\n" +
            "                \"large\": \"https://img1.doubanio.com/view/subject/l/public/s28065888.jpg\",\n" +
            "                \"medium\": \"https://img1.doubanio.com/view/subject/m/public/s28065888.jpg\"\n" +
            "            },\n" +
            "            \"alt\": \"https://book.douban.com/subject/26359758/\",\n" +
            "            \"id\": \"26359758\",\n" +
            "            \"publisher\": \"湖南文艺出版社\",\n" +
            "            \"isbn10\": \"7540471301\",\n" +
            "            \"isbn13\": \"9787540471309\",\n" +
            "            \"title\": \"硬派健身\",\n" +
            "            \"url\": \"https://api.douban.com/v2/book/26359758\",\n" +
            "            \"alt_title\": \"\",\n" +
            "            \"author_intro\": \"斌卡\\n健身导师，硬派健身创始人。\\n2014年2月27日，斌卡在硬派健身微信订阅号里发表第一篇文章。\\n2014年3月27日，仅一个月，硬派健身微信订阅号关注者就突破30,000人。\\n2014年6月4日，《硬派健身•减肥篇：知乎斌卡自选集》在各大电子商务平台上架。\\n2014年9月，《硬派健身•减肥篇：知乎斌卡自选集》拿下亚马逊电子书季度销售榜冠军，并且至今仍在分类榜单排名第一。\\n2014年10月，斌卡获得雷军旗下顺为资本的天使投资，开始做自己真正关心的事情。\\n2015年5月，“硬派健身”平台在微信、知乎的粉丝突破1,000,000。\",\n" +
            "            \"summary\": \"十年前，我开始了自己的健身训练。然而，我却走了不少弯路，听信了不少错误的传言。\\n十年间，我发现这世界有太多的人云亦云，太多的误人子弟，太多的急功近利，太多的寡廉鲜耻。\\n十年后，此时、此地，我愿《硬派健身》，成为你的第一本健身书。\",\n" +
            "            \"ebook_price\": \"17.99\",\n" +
            "            \"price\": \"48.00元\"\n" +
            "        },\n" +
            "        {\n" +
            "            \"rating\": {\n" +
            "                \"max\": 10,\n" +
            "                \"numRaters\": 695,\n" +
            "                \"average\": \"8.2\",\n" +
            "                \"min\": 0\n" +
            "            },\n" +
            "            \"subtitle\": \"最好的运动\",\n" +
            "            \"author\": [\n" +
            "                \"鲍勃·安德森\"\n" +
            "            ],\n" +
            "            \"pubdate\": \"2010-10\",\n" +
            "            \"tags\": [\n" +
            "                {\n" +
            "                    \"count\": 796,\n" +
            "                    \"name\": \"健身\",\n" +
            "                    \"title\": \"健身\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 557,\n" +
            "                    \"name\": \"运动\",\n" +
            "                    \"title\": \"运动\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 434,\n" +
            "                    \"name\": \"健康\",\n" +
            "                    \"title\": \"健康\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 349,\n" +
            "                    \"name\": \"拉伸\",\n" +
            "                    \"title\": \"拉伸\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 130,\n" +
            "                    \"name\": \"养生\",\n" +
            "                    \"title\": \"养生\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 124,\n" +
            "                    \"name\": \"运动恢复\",\n" +
            "                    \"title\": \"运动恢复\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 105,\n" +
            "                    \"name\": \"生活与健康\",\n" +
            "                    \"title\": \"生活与健康\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 90,\n" +
            "                    \"name\": \"生活\",\n" +
            "                    \"title\": \"生活\"\n" +
            "                }\n" +
            "            ],\n" +
            "            \"origin_title\": \"\",\n" +
            "            \"image\": \"https://img3.doubanio.com/view/subject/m/public/s4464243.jpg\",\n" +
            "            \"binding\": \"\",\n" +
            "            \"translator\": [\n" +
            "                \"边然\"\n" +
            "            ],\n" +
            "            \"catalog\": \"第一章 开始拉伸吧!\\n概述\\n谁应当拉伸?\\n什么时候拉伸?\\n为什么要拉伸?\\n如何拉伸?\\n热身活动和整理活动\\n跟着感觉拉伸!\\n第二章 拉伸动作讲解\\n拉伸导图\\n背部和腰部的卧位拉伸\\n腿部和脚部的坐位和卧位拉伸\\n肩背部和手臂的拉伸\\n腿部的跪坐和跨步位拉伸\\n腰髋部、腹股沟以及大腿后腱的拉伸\\n腰背部和腿部的碾压和下蹲拉伸\\n抬升双脚的拉伸\\n腿部和髋部的站位拉伸\\n上半身的站位拉伸\\n单杠上的拉伸\\n利用毛巾进行的上半身拉伸\\n双手、手腕以及前臂的拉伸\\n坐位拉伸\\n抬升双脚时的腿部和腹股沟的高级拉伸\\n双腿分开时的腹股沟和髋部的拉伸\\n劈叉动作\\n第三章 日常放松拉伸\\n清晨的拉伸\\n睡前的拉伸\\n每天必做的拉伸\\n双手、手臂以及肩膀的拉伸\\n颈部和肩膀的拉伸\\n腰部的拉伸\\n腿部．腹股沟以及髋部的拉伸\\n随时随地进行的拉伸\\n60岁以上老年人的拉伸\\n儿童的拉伸\\n看电视时的拉伸\\n散步前后的拉伸\\n家庭劳动前后的拉伸\\n驾驶者和旅行者的拉伸\\n第四章 办公室拉伸\\n办公室健康\\n工作开始前的拉伸\\n电脑使用者的拉伸\\n专业设计师的拉伸\\n开会时的拉伸\\n上网时的拉伸\\n利用复印机进行的拉伸\\n打电话时的拉伸\\n压力过大时的拉伸\\n久坐后的拉伸\\n出差乘飞机的拉伸\\n体力工作前的拉伸\\n第五章 体育运动拉伸\\n有氧运动\\n跑步\\n游泳\\n轮滑\\n滑板\\n篮球\\n足球\\n排球\\n乒乓球\\n网球\\n羽毛球\\n保龄球\\n高尔夫球\\n棒球／垒球\\n墙球、手球及壁球\\n冰球\\n橄榄球\\n体操\\n武术\\n花样滑冰\\n力量训练\\n摔跤-l\\n铁人三项\\n远足¨\\n爬山／攀岩\\n利用登山杖拉伸\\n自行车\\n山地自行车\\n越野摩托车\\n骑马\\n马术竞赛\\n划船\\n皮划艇\\n冲浪\\n帆板\\n越野滑雪\\n高山滑雪\\n致老师与教练\\n附录\\n关注腰背健康\\n动态拉伸\\nPNF拉伸\\n拉伸动作全图\\n作者介绍\",\n" +
            "            \"pages\": \"231\",\n" +
            "            \"images\": {\n" +
            "                \"small\": \"https://img3.doubanio.com/view/subject/s/public/s4464243.jpg\",\n" +
            "                \"large\": \"https://img3.doubanio.com/view/subject/l/public/s4464243.jpg\",\n" +
            "                \"medium\": \"https://img3.doubanio.com/view/subject/m/public/s4464243.jpg\"\n" +
            "            },\n" +
            "            \"alt\": \"https://book.douban.com/subject/5068077/\",\n" +
            "            \"id\": \"5068077\",\n" +
            "            \"publisher\": \"北京科学技术出版社\",\n" +
            "            \"isbn10\": \"753044767X\",\n" +
            "            \"isbn13\": \"9787530447673\",\n" +
            "            \"title\": \"拉伸\",\n" +
            "            \"url\": \"https://api.douban.com/v2/book/5068077\",\n" +
            "            \"alt_title\": \"\",\n" +
            "            \"author_intro\": \"\",\n" +
            "            \"summary\": \"《拉伸:最好的运动》内容简介：拉伸，最好的运动——任何人在任何时间和地点都可以进行的简单和柔和的运动。现代人越来越有健康意识，而健康的指标之一，就是筋骨柔软度。想要增加身体的柔软度，最简单的方法，就是每天进行规律的拉伸，而且只需几分钟。全球最知名的拉伸教练鲍伯·安德鲁在《拉伸:最好的运动》中，综合自身多年经验，为您详细剖析每种拉伸方法的原理，教您如何渐次拉伸全身肌肉。安德森针对身体各个部位如颈、肩、背、腰、髋、臀、腿、手、脚，以及不同状况如起床前后、打电脑、久坐之后、坐飞机等，还有不同职业、年龄的人，设计出人人都需要的拉伸动作。即使是最忙碌、最不爱运动的人，安德森也没放过，他设计出可让你边看电视边做的拉伸动作，保证让你气脉畅通、疲倦尽消。《拉伸:最好的运动》的另一重点是针对慢跑、游泳、高尔夫、爬山、骑自行车等二十多种运动，设计出运动前后不可或缺的拉伸动作，让你更能尽情享受运动的好处，不用担心运动伤害。\",\n" +
            "            \"price\": \"32.00元\"\n" +
            "        },\n" +
            "        {\n" +
            "            \"rating\": {\n" +
            "                \"max\": 10,\n" +
            "                \"numRaters\": 143,\n" +
            "                \"average\": \"8.8\",\n" +
            "                \"min\": 0\n" +
            "            },\n" +
            "            \"subtitle\": \"\",\n" +
            "            \"author\": [\n" +
            "                \"尼克·埃文斯\"\n" +
            "            ],\n" +
            "            \"pubdate\": \"2008-1\",\n" +
            "            \"tags\": [\n" +
            "                {\n" +
            "                    \"count\": 532,\n" +
            "                    \"name\": \"健身\",\n" +
            "                    \"title\": \"健身\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 319,\n" +
            "                    \"name\": \"运动\",\n" +
            "                    \"title\": \"运动\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 282,\n" +
            "                    \"name\": \"健身解剖指南\",\n" +
            "                    \"title\": \"健身解剖指南\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 236,\n" +
            "                    \"name\": \"肌肉解剖\",\n" +
            "                    \"title\": \"肌肉解剖\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 227,\n" +
            "                    \"name\": \"器材健身\",\n" +
            "                    \"title\": \"器材健身\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 224,\n" +
            "                    \"name\": \"营养与健身\",\n" +
            "                    \"title\": \"营养与健身\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 209,\n" +
            "                    \"name\": \"健康\",\n" +
            "                    \"title\": \"健康\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"count\": 169,\n" +
            "                    \"name\": \"人体解剖\",\n" +
            "                    \"title\": \"人体解剖\"\n" +
            "                }\n" +
            "            ],\n" +
            "            \"origin_title\": \"\",\n" +
            "            \"image\": \"https://img1.doubanio.com/view/subject/m/public/s3086837.jpg\",\n" +
            "            \"binding\": \"\",\n" +
            "            \"translator\": [\n" +
            "                \"刘润芝\"\n" +
            "            ],\n" +
            "            \"catalog\": \"第一章  肩第二章  胸第三章  背第四章  手臂第五章  腿第六章  腹部\",\n" +
            "            \"pages\": \"177\",\n" +
            "            \"images\": {\n" +
            "                \"small\": \"https://img1.doubanio.com/view/subject/s/public/s3086837.jpg\",\n" +
            "                \"large\": \"https://img1.doubanio.com/view/subject/l/public/s3086837.jpg\",\n" +
            "                \"medium\": \"https://img1.doubanio.com/view/subject/m/public/s3086837.jpg\"\n" +
            "            },\n" +
            "            \"alt\": \"https://book.douban.com/subject/2985774/\",\n" +
            "            \"id\": \"2985774\",\n" +
            "            \"publisher\": \"北京体育大学出版社\",\n" +
            "            \"isbn10\": \"7811009323\",\n" +
            "            \"isbn13\": \"9787811009323\",\n" +
            "            \"title\": \"健身解剖指南\",\n" +
            "            \"url\": \"https://api.douban.com/v2/book/2985774\",\n" +
            "            \"alt_title\": \"\",\n" +
            "            \"author_intro\": \"尼克·埃文斯(Nick Evans)博士，外科医生，精通体育医学，是牵伸训练、营养和负重训练损伤方面的权威，也是肌肉骨骼解剖方面的专家，创作了许多科学著作。\",\n" +
            "            \"summary\": \"《健身解剖指南》重点针对肩、胸、背、手臂、腿和腹部的主要肌肉群及平时难以训练到的身体部位，较好地诠释了臃肿的身体和理想的体格之间的差异。通过此书，您将学会如何根据自身的特定需求改善健身技巧，从而达到理想而惊人的效果。\",\n" +
            "            \"price\": \"55.00元\"\n" +
            "        }\n" +
            "    ]";
}
